app/controllers/sessions_controller.rb

  def show_secret
    puts params[:id]
    current_user
    puts @current_user.id
  #@user = User.find(params[:id])
    #puts @user.id
    if logged_in? == false
      flash.now[:danger] = "Il faut être connecté.e pour voir ton profil du Club Privé !"
      render 'new'
    else @user = User.find(params[:id])
      @user_first_name = @user.first_name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def secret_page
    @array_users = []
    if logged_in? == false
      flash[:danger] = "Il faut être connecté.e pour voir le Club Privé !"
      redirect_to '/login'
    else
      params[:id] = @current_user.id
      #puts params[:id]
      User.all.each do |user|
---
SELECT "users".* FROM "users"