app/controllers/staticpages_controller.rb

  def secret_page
    @array_users = []
    if logged_in? == false
      flash[:danger] = "Il faut être connecté.e pour voir le Club Privé !"
      redirect_to '/login'
    else
      puts User.all
      User.all.each do |user|
---
SELECT "users".* FROM "users"