app/controllers/users_controller.rb

  def create
    @user = User.new(first_name: params[:session]["first_name"], last_name: params[:session]["last_name"], email: params[:session]["email"], password: params[:session]["password"], password_confirmation: params[:session]["password_confirmation"])
    if
      @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)